Comment: Modified version of Firefox.jamf.recipe.yaml from com.github.autopkg.grahampugh-recipes
Identifier: com.github.integrar.jamfupload.Firefox
ParentRecipe: com.github.rtrouton.pkg.Firefox
MinimumVersion: '2.3'

Input:
  NAME: Firefox
  CATEGORY: Web Browsers
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'
