Comment: Modified version of Jamf Upload Policies from com.github.autopkg.grahampugh-recipes
Identifier: com.github.integrar.jamfupload.microsoftpowerpoint365
ParentRecipe: com.github.rtrouton.pkg.microsoftpowerpoint365
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Powerpoint
  CATEGORY: Microsoft
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

