Comment: Modified version of microsoft.jamf.recipe.yaml from com.github.autopkg.grahampugh-recipes
Identifier: com.github.integrar.jamfupload.microsoftedge
ParentRecipe: com.github.rtrouton.pkg.microsoftedge
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Edge
  CATEGORY: Web Browsers
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'


