Comment: Modified version of Jamf Upload Policies from com.github.autopkg.grahampugh-recipes
Identifier: com.github.integrar.jamfupload.vlc
ParentRecipe: com.github.autopkg.pkg.VLC
MinimumVersion: '2.3'

Input:
  NAME: VLC
  CATEGORY: Digital Media
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

