Comment: Modified version of Jamf Upload Policies from com.github.autopkg.grahampugh-recipes
Identifier: com.github.integrar.jamfupload.zoom
ParentRecipe: com.github.homebysix.pkg.Zoom
MinimumVersion: '2.3'

Input:
  NAME: Zoom Client for Meetings
  CATEGORY: Collaboration
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

